summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC12_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC12_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC12_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC12_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC12_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC12_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC12_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC12_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC12_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC12_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061CB2u)

/** \\brief  C, Revision ID Register */
#define MC12_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061C0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc13
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC13_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061D00u)

/** \\brief  2, Configuration Register 1 */
#define MC13_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061D02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC13_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061D10u)

/** \\brief  E, ECC Safety Register */
#define MC13_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0061D0Eu)

/** \\brief  12, Error Tracking Register */
#define MC13_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D12u)

/** \\brief  14, Error Tracking Register */
#define MC13_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D14u)

/** \\brief  16, Error Tracking Register */
#define MC13_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D16u)

/** \\brief  18, Error Tracking Register */
#define MC13_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D18u)

/** \\brief  1A, Error Tracking Register */
#define MC13_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D1Au)

/** \\brief  4, MBIST Control Register */
#define MC13_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061D04u)

/** \\brief  6, Status Register */
#define MC13_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061D06u)

/** \\brief  8, Range Register, single address mode */
#define MC13_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061D08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC13_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC13_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC13_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC13_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC13_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC13_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC13_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC13_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC13_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC13_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC13_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC13_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC13_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC13_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC13_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC13_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC13_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC13_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC13_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC13_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC13_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC13_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC13_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC13_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC13_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC13_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC13_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC13_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC13_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC13_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE6u)

