summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC52_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC52_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC52_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC52_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC52_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC52_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC52_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC52_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC52_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC52_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644B2u)

/** \\brief  C, Revision ID Register */
#define MC52_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006440Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc53
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC53_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064500u)

/** \\brief  2, Configuration Register 1 */
#define MC53_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064502u)

/** \\brief  10, Memory ECC Detection Register */
#define MC53_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064510u)

/** \\brief  E, ECC Safety Register */
#define MC53_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006450Eu)

/** \\brief  12, Error Tracking Register */
#define MC53_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064512u)

/** \\brief  14, Error Tracking Register */
#define MC53_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064514u)

/** \\brief  16, Error Tracking Register */
#define MC53_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064516u)

/** \\brief  18, Error Tracking Register */
#define MC53_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064518u)

/** \\brief  1A, Error Tracking Register */
#define MC53_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006451Au)

/** \\brief  4, MBIST Control Register */
#define MC53_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064504u)

/** \\brief  6, Status Register */
#define MC53_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064506u)

/** \\brief  8, Range Register, single address mode */
#define MC53_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064508u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC53_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC53_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC53_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC53_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC53_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC53_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC53_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC53_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC53_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC53_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC53_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC53_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC53_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC53_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC53_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC53_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC53_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC53_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC53_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC53_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC53_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC53_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC53_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC53_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC53_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC53_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC53_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC53_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC53_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC53_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00645E6u)

