summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC67_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC67_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC67_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC67_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC67_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC67_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC67_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC67_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC67_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC67_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B2u)

/** \\brief  C, Revision ID Register */
#define MC67_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006530Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc68
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC68_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065400u)

/** \\brief  2, Configuration Register 1 */
#define MC68_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065402u)

/** \\brief  10, Memory ECC Detection Register */
#define MC68_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065410u)

/** \\brief  E, ECC Safety Register */
#define MC68_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006540Eu)

/** \\brief  12, Error Tracking Register */
#define MC68_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065412u)

/** \\brief  14, Error Tracking Register */
#define MC68_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065414u)

/** \\brief  16, Error Tracking Register */
#define MC68_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065416u)

/** \\brief  18, Error Tracking Register */
#define MC68_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065418u)

/** \\brief  1A, Error Tracking Register */
#define MC68_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006541Au)

/** \\brief  4, MBIST Control Register */
#define MC68_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065404u)

/** \\brief  6, Status Register */
#define MC68_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065406u)

/** \\brief  8, Range Register, single address mode */
#define MC68_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065408u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC68_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC68_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC68_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC68_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC68_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC68_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC68_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC68_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC68_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC68_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC68_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC68_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC68_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC68_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC68_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC68_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC68_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC68_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC68_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC68_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC68_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC68_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC68_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC68_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC68_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC68_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC68_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC68_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC68_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC68_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00654E6u)

