summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC87_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC87_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC87_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC87_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC87_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC87_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC87_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC87_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC87_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC87_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667B2u)

/** \\brief  C, Revision ID Register */
#define MC87_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006670Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMC_REG_H */
